chapter9/2DheatXferTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottom
    {
        type            patch;
        nFaces          100;
        startFace       39700;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       39800;
    }
    left
    {
        type            wall;
        nFaces          200;
        startFace       39900;
    }
    right
    {
        type            wall;
        nFaces          200;
        startFace       40100;
    }
    frontAndBack
    {
        type            empty;
        nFaces          40000;
        startFace       40300;
    }
)

// ************************************************************************* //
